blog/how-to-convert-aiff-to-mp3-on-command-line.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何在命令行上将AIFF格式转换为MP3格式</title>
<!-- 2019-03-25 Mon 08:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">如何在命令行上将AIFF格式转换为MP3格式</h1>
<p>
单个文件转换：
</p>
<pre class="example">
ffmpeg -i myinput.aif -f mp3 -acodec libmp3lame -ab 320000 -ar 44100 myoutput.mp3
</pre>

<p>
批量文件转换：
</p>
<pre class="example">
for f in *.aiff; do ffmpeg -i "$f" -f mp3 -acodec libmp3lame -ab 320000 -ar 44100 "${f%.aiff}.mp3"; done
</pre>

<p>
上面指定了比特率，MP3最大为320kbit/s，文件大小会稍微大点，音质会好点，虽然我听不太出来，哈哈，看自己需要。所以你也可以采用默认参数转换，文件会小一半大概，例如：
</p>
<pre class="example">
for f in *.aiff; do ffmpeg -i "$f" "${f%.aiff}.mp3"; done
</pre>

<p>
更多参数使用详见 man ffmpeg
</p>

<p>
参考：
<a href="https://lerks.blog/how-to-convert-aiff-to-mp3-on-command-line/">How to convert AIFF to MP3 on command line</a>
</p>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>